{
  "ir_version": "1.0",
  "project": "AI Assist Kit",
  "repository": "https://github.com/grokify/aiassistkit",

  "legend": {
    "completed": {"emoji": "✅", "description": "Completed"},
    "in_progress": {"emoji": "🚧", "description": "In Progress"},
    "planned": {"emoji": "📋", "description": "Planned"},
    "future": {"emoji": "💡", "description": "Under Consideration"}
  },

  "areas": [
    {"id": "core", "name": "Core", "priority": 1},
    {"id": "config", "name": "Configuration", "priority": 2},
    {"id": "plugins", "name": "Plugins & Extensions", "priority": 3},
    {"id": "tools", "name": "Tools & Adapters", "priority": 4}
  ],

  "phases": [
    {
      "id": "v0.1",
      "name": "v0.1.0 - Initial Release",
      "status": "completed",
      "order": 1,
      "description": "Complete configuration management for AI coding assistants"
    },
    {
      "id": "v0.2",
      "name": "v0.2.0 - Settings & Rules",
      "status": "planned",
      "order": 2,
      "description": "Add settings and rules configurations"
    },
    {
      "id": "v1.0",
      "name": "v1.0.0 - General Availability",
      "status": "planned",
      "order": 3,
      "description": "Production-ready release with CLI tool"
    },
    {
      "id": "future",
      "name": "Future",
      "status": "future",
      "order": 99,
      "description": "Post v1.0 enhancements"
    }
  ],

  "items": [
    {
      "id": "mcp-core",
      "title": "MCP core types",
      "description": "Canonical Config, Server, Transport types for MCP",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "config",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-claude",
      "title": "Claude MCP adapter",
      "description": "Claude Code / Claude Desktop .mcp.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-cursor",
      "title": "Cursor MCP adapter",
      "description": "Cursor IDE ~/.cursor/mcp.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-windsurf",
      "title": "Windsurf MCP adapter",
      "description": "Windsurf/Codeium mcp_config.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-vscode",
      "title": "VS Code MCP adapter",
      "description": "VS Code / GitHub Copilot mcp.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-codex",
      "title": "Codex MCP adapter",
      "description": "OpenAI Codex CLI config.toml (TOML) support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-cline",
      "title": "Cline MCP adapter",
      "description": "Cline VS Code extension support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "mcp-roo",
      "title": "Roo Code MCP adapter",
      "description": "Roo Code VS Code extension support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "mcp-kiro",
      "title": "AWS Kiro MCP adapter",
      "description": "AWS Kiro CLI support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "context-core",
      "title": "Context core types",
      "description": "Canonical Context, Architecture, Package types",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "config",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "context-claude",
      "title": "Claude context converter",
      "description": "CONTEXT.json to CLAUDE.md converter",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "plugins-core",
      "title": "Plugin core types",
      "description": "Canonical Plugin struct for manifests",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "plugins-schema",
      "title": "Plugin JSON Schema",
      "description": "plugin.schema.json for validation",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "plugins-claude",
      "title": "Claude plugin adapter",
      "description": "Generate .claude-plugin/plugin.json",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "plugins-gemini",
      "title": "Gemini extension adapter",
      "description": "Generate gemini-extension.json",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-core",
      "title": "Command core types",
      "description": "Canonical Command struct for prompts/commands",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-schema",
      "title": "Command JSON Schema",
      "description": "command.schema.json for validation",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-claude",
      "title": "Claude command adapter",
      "description": "Generate commands/*.md (Markdown + YAML)",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-gemini",
      "title": "Gemini command adapter",
      "description": "Generate commands/*.toml (TOML)",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-codex",
      "title": "Codex prompt adapter",
      "description": "Generate prompts/*.md (Markdown + YAML)",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "skills-core",
      "title": "Skill core types",
      "description": "Canonical Skill struct for skills",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "skills-schema",
      "title": "Skill JSON Schema",
      "description": "skill.schema.json for validation",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "skills-claude",
      "title": "Claude skill adapter",
      "description": "Generate skills/*/SKILL.md",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "skills-codex",
      "title": "Codex skill adapter",
      "description": "Generate skills/*/SKILL.md",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "agents-core",
      "title": "Agent core types",
      "description": "Canonical Agent struct for agent definitions",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "agents-schema",
      "title": "Agent JSON Schema",
      "description": "agent.schema.json for validation",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "agents-claude",
      "title": "Claude Code agent adapter",
      "description": "Generate agents/*.md for Claude Code",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "agents-gemini",
      "title": "Gemini CLI agent adapter",
      "description": "Generate agent definitions for Gemini CLI",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "agents-codex",
      "title": "Codex CLI agent adapter",
      "description": "Generate agent definitions for OpenAI Codex CLI",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "agents-kiro",
      "title": "Kiro CLI agent adapter",
      "description": "Generate agent definitions for AWS Kiro CLI",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "teams-core",
      "title": "Teams core types",
      "description": "Team, Task, Subtask, Process, Status types for multi-agent orchestration",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "teams-schema",
      "title": "Teams JSON Schema",
      "description": "team.schema.json for validation",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "validation-core",
      "title": "Validation core types",
      "description": "ValidationArea, Check types for release validation",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "validation-claude",
      "title": "Claude validation adapter",
      "description": "Validation adapter for Claude Code",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "validation-codex",
      "title": "Codex validation adapter",
      "description": "Validation adapter for OpenAI Codex CLI",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "validation-gemini",
      "title": "Gemini validation adapter",
      "description": "Validation adapter for Google Gemini CLI",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "settings-core",
      "title": "Settings core types",
      "description": "Canonical Settings struct for permissions/sandbox",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "config",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "settings-claude",
      "title": "Claude settings adapter",
      "description": "Claude Code settings.json support",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "rules-core",
      "title": "Rules core types",
      "description": "Canonical Rules struct for coding guidelines",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "config",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "rules-cursor",
      "title": "Cursor rules adapter",
      "description": ".cursorrules generation",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "rules-copilot",
      "title": "Copilot instructions adapter",
      "description": ".github/copilot-instructions.md generation",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "context-gemini",
      "title": "Gemini context converter",
      "description": "CONTEXT.json to GEMINI.md converter",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "context-codex",
      "title": "Codex context converter",
      "description": "CONTEXT.json to AGENTS.md converter",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "cli-generate",
      "title": "CLI generate command",
      "description": "aiassistkit generate for multi-tool output",
      "status": "planned",
      "version": "1.0.0",
      "phase": "v1.0",
      "area": "core",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "cli-validate",
      "title": "CLI validate command",
      "description": "aiassistkit validate for schema validation",
      "status": "planned",
      "version": "1.0.0",
      "phase": "v1.0",
      "area": "core",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "cli-convert",
      "title": "CLI convert command",
      "description": "aiassistkit convert for format conversion",
      "status": "planned",
      "version": "1.0.0",
      "phase": "v1.0",
      "area": "core",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "aider-support",
      "title": "Aider support",
      "description": "Aider AI coding assistant adapters",
      "status": "future",
      "phase": "future",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "continue-support",
      "title": "Continue support",
      "description": "Continue VS Code extension adapters",
      "status": "future",
      "phase": "future",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "avante-support",
      "title": "Avante support",
      "description": "Avante Neovim plugin adapters",
      "status": "future",
      "phase": "future",
      "area": "tools",
      "type": "Added",
      "priority": "low"
    }
  ],

  "sections": [
    {
      "id": "overview",
      "title": "Overview",
      "order": 1,
      "content": [
        {"type": "text", "value": "AI Assist Kit provides a unified Go library for managing configuration files across multiple AI coding assistants. It enables define-once, generate-everywhere workflows through canonical types and tool-specific adapters."}
      ]
    },
    {
      "id": "references",
      "title": "References",
      "order": 99,
      "content": [
        {"type": "list", "items": [
          "[PRD.md](PRD.md) - Product requirements",
          "[TRD.md](TRD.md) - Technical requirements",
          "[README.md](README.md) - User documentation"
        ]}
      ]
    }
  ],

  "version_history": [
    {"version": "0.1.0", "date": "2026-01-12", "status": "completed", "summary": "Initial release with MCP, Context, Plugins, Commands, Skills, Agents, Teams, Validation"},
    {"version": "0.2.0", "date": null, "status": "planned", "summary": "Settings and Rules"},
    {"version": "1.0.0", "date": null, "status": "planned", "summary": "General availability with CLI"}
  ]
}
